#include <stdio.h>

/////////////////////////////////////////////////////////
//  침식 함수
/////////////////////////////////////////////////////////
void erosion(int** map, int i, int j, int* cnt, int group) {

	cnt[group]++;
	map[i][j] = 0;  //침식점 0으로 변환
	if (map[i + 1][j] == 1) {  //하 침식
		erosion(map, i + 1, j, cnt, group);
	}
	if (map[i][j + 1] == 1) {  //우 침식
		erosion(map, i, j + 1, cnt, group);
	}
	if (map[i - 1][j] == 1) {  //상 침식
		erosion(map, i - 1, j, cnt, group);
	}
	if (map[i][j - 1] == 1) {  //좌 침식
		erosion(map, i, j - 1, cnt, group);
	}

	return 0;
}

/////////////////////////////////////////////////////////
//  메인함수
/////////////////////////////////////////////////////////
int main() {
	int n;
	int i, j;  //for문용 변수
	int min;
	int** map1;
	int* cnt;
	int group1 = 0;  //영역 갯수 저장
	char ch_temp;

	scanf("%d", &n);  //그리드 크기 입력

	/////////////////////////////////////////////////////////
	//  맵 할당 및 매핑
	/////////////////////////////////////////////////////////
	cnt = (int*)malloc(sizeof(int) * (n * n));
	map1 = (int**)malloc(sizeof(int*) * (n + 2));
	for (i = 0; i <= n + 1; i++) {
		map1[i] = (int*)malloc(sizeof(int) * (n + 2));  //태두리까지 n+2
		for (j = 0; j <= n + 1; j++) {
			if ((i == n + 1 || j == n + 1) || (i == 0 || j == 0)) {  //태두리는 0으로 표시
				map1[i][j] = 0;
			}
			else {
				scanf(" %c", &ch_temp);  //건물 입력
				if (ch_temp == '1') {
					map1[i][j] = 1;
				}
				else {
					map1[i][j] = 0;
				}
			}
		}
	}

	/////////////////////////////////////////////////////////
	//  침식
	/////////////////////////////////////////////////////////
	for (i = 1; i <= n; i++) {
		for (j = 1; j <= n; j++) {  //침식되지 않은 점 찾기
			if (map1[i][j] != 0) {
				group1++;  //영역 +1
				cnt[group1] = 0;
				erosion(map1, i, j, cnt, group1);  //그점 중심으로 침식
			}
		}
	}


	/////////////////////////////////////////////////////////
	//  결과 출력
	/////////////////////////////////////////////////////////
	printf("%d\n", group1);  //단지 출력
	min = 0;
	i = 0;
	while (1) {  //오름차순 출력
		for (j = 1; j <= group1; j++) {
			if (cnt[j] == min) {
				printf("%d\n", min);
				i++;
			}
		}
		if (i == group1) {
			break;
		}
		min++;
	}

	/////////////////////////////////////////////////////////
	//  할당 해제
	/////////////////////////////////////////////////////////
	for (i = 0; i < n; i++) {
		free(map1[i]);
	}
	free(map1);
	free(cnt);

	return 0;
}
