#include <stdio.h>

int main() {

	int n;  //방 크기
	int m[101][101] = { .0 };  //방 구조 행렬. 최대크기는 100*100이지만 끝지점을 0으로 표현하기 위해 사이즈를 1씩 더 키움
	int i, j, k;
	int sum_x = 0;  //가로 갯수
	int sum_y = 0;  //세로 갯수
	char ch[101];

	scanf("%d", &n);  //방 크기 입력

	/////////////////////////////////////////////////////////////////////
	//  방 구조 행렬화
	/////////////////////////////////////////////////////////////////////
	for (i = 0; i < n; i++) {
		scanf("%s", ch);
		for (j = 0; j < n; j++) {
			if (ch[j] == 'X') {  //'X'를 1로 저장
				m[i][j] = 1;
			}
			else if (ch[j] == '.') {  //'.'을 2로 저장
				m[i][j] = 2;
			}
		}
	}

	/////////////////////////////////////////////////////////////////////
	// 가로 갯수 구하기
	/////////////////////////////////////////////////////////////////////
	for (i = 0; i < n; i++) {
		for (j = 0; j < n; j++) {  //시작점 훑기
			if(m[i][j]==2){
				for (k = 1; m[i][j + k] == 2; k++) {  //시작점으로부터 '.'가 계속되는 좌표 카운트
					if (k == 1) {  //시작점 다음칸이 '.'면 가로방향 +1
						sum_x++;
					}
				}
				j = j + k-1;  //'.'가 연속되는만큼 시작점을 점프
			}
		}
	}

	/////////////////////////////////////////////////////////////////////
	// 세로 갯수 구하기
	/////////////////////////////////////////////////////////////////////
	for (j = 0; j < n; j++) {
		for (i = 0; i < n; i++) {  //시작점 훑기
			if (m[i][j] == 2) {
				for (k = 1; m[i + k][j] == 2; k++) {  //시작점으로부터 '.'가 계속되는 좌표 카운트
					if (k == 1) {  //시작점 다음칸이 '.'면 세로방향 +1
						sum_y++;
					}
				}
				i = i + k-1;  //'.'가 연속되는만큼 시작점을 점프
			}
		}
	}

	printf("%d %d", sum_x, sum_y);  //출력

	return 0;
}
