#include <stdio.h>
#include <string.h>

int main() {
	int m_index = 0;  //맨 뒤 위치(크기) 변수
	int m_cmd_count = 0;  //커맨드 횟수 변수
	int i = 0;  //for문용 변수
	int m_deque[10000] = { .0 };  //스택
	char m_cmd[11]; //커맨드 입력

	scanf("%d", &m_cmd_count);  //커맨드 횟수 입력

	while (m_cmd_count != 0) {
		for (i = 0; i < 11; i++) {  //문자열 초기화
			m_cmd[i] = ' ';
		}

		scanf("%s", m_cmd);  //커맨드 입력

		////////////////////////////////////////////////////////////////
		// push_front
		////////////////////////////////////////////////////////////////
		if (strcmp(m_cmd, "push_front") == 0) {
			for (i = m_index; i > 0; i--) {  //덱 뒤로 밀기
				m_deque[i] = m_deque[i - 1];
			}
			scanf("%d", &m_deque[0]);  //맨 앞에 넣기
			m_index++;  //덱 크기 증가
		}
		////////////////////////////////////////////////////////////////
		// push_back
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "push_back") == 0) {
			scanf("%d", &m_deque[m_index]);  //맨 뒤에 넣기
			m_index++;  //덱 크기 증가
		}
		////////////////////////////////////////////////////////////////
		// pop_front
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "pop_front") == 0) {
			if (m_index == 0) {
				printf("-1\n");
			}
			else {
				printf("%d\n", m_deque[0]);  //맨 앞 덱 출력
				for (i = 1; i < m_index; i++) {
					m_deque[i - 1] = m_deque[i];
				}
				m_index--;  //덱 크기 감소
				m_deque[m_index] = 0;  //마지막 덱 반환
			}
		}
		////////////////////////////////////////////////////////////////
		// pop_back
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "pop_back") == 0) {
			if (m_index == 0) {
				printf("-1\n");
			}
			else {
				m_index--;  //덱 크기 감소
				printf("%d\n", m_deque[m_index]);  //맨 뒤 덱 출력
				m_deque[m_index] = 0;  //마지막 덱 반환
			}
		}
		////////////////////////////////////////////////////////////////
		// size
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "size") == 0) {
			printf("%d\n", m_index);  //크기 출력
		}
		////////////////////////////////////////////////////////////////
		// empty
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "empty") == 0) {
			if (m_index == 0) {
				printf("1\n");
			}
			else {
				printf("0\n");
			}
		}
		////////////////////////////////////////////////////////////////
		// front
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "front") == 0) {
			if (m_index == 0) {
				printf("-1\n");
			}
			else {
				printf("%d\n", m_deque[0]);  //맨 앞 덱 출력
			}
		}
		////////////////////////////////////////////////////////////////
		// back
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "back") == 0) {
			if (m_index == 0) {
				printf("-1\n");
			}
			else {
				printf("%d\n", m_deque[m_index - 1]);  //맨 뒤 덱 출력
			}
		}

		m_cmd_count--;  //커맨드 횟수 감소
	}

	return 0;
}
