#include <stdio.h>
#include <stdlib.h>

int main() {
	int n;
	int p;
	int* score;
	int new_score;
	int temp;
	int i, j;

	////////////////////////////////////////////////////
	//  변수 입력
	////////////////////////////////////////////////////
	scanf("%d %d %d", &n, &new_score, &p);

	////////////////////////////////////////////////////
	//  랭킹이 없으면 1위
	////////////////////////////////////////////////////
	if (n == 0) {
		printf("1");
		return 0;
	}

	////////////////////////////////////////////////////
	//  랭킹 생성 및 입력
	////////////////////////////////////////////////////
	score = (int*)malloc(sizeof(int) * n);
	for (i = 0; i < n; i++) {
		scanf("%d", &score[i]);
	}

	////////////////////////////////////////////////////
	//  랭킹 정렬
	////////////////////////////////////////////////////
	for (i = 0; i < n; i++) {
		for (j = i+1; j < n; j++) {
			if (score[i] < score[j]) {
				temp = score[i];
				score[i] = score[j];
				score[j] = temp;
			}
		}
	}

	////////////////////////////////////////////////////
	//  순위 찾기
	////////////////////////////////////////////////////
	for (i = n - 1; i >= 0; i--) {  // 랭킹 뒤에서부터
		if (new_score == score[i]){  // 동점자가 있으면
			if (p <= i + 1) {  // 순위권 밖인지 확인
				printf("-1");
				free(score);
				return 0;
			}
			while (i > 0 && score[i] == score[i - 1]) {  // 동점자 맨 앞으로 이동
				i--;  // i가 음수가 되지 않도록 조심
			}
			printf("%d", i + 1);  // 순위 출력
			free(score);  // 할당 해제
			return 0;  // 종료
		}
		if (new_score < score[i]) {  // 높은 점수 찾으면
			if (p < i + 2) {  // 순위권 밖인지 확인
				printf("-1");
				free(score);  // 할당 해제
				return 0;  // 종료
			}
			printf("%d", i + 2);  // 순위 출력
			free(score);  // 할당 해제
			return 0;  // 종료
		}
	}
	printf("1");  // 높은점수 못 찾았으면 1등
	free(score);  // 할당 해제

	return 0;
}
