#include <stdio.h>
#include <string.h>

int main() {
	int m_index = 0;  //맨 위 스택 위치(크기) 변수
	int m_cmd_count = 0;  //커맨드 횟수 변수
	int i = 0;  //for문용 변수
	int m_stack[10000] = { .0 };  //스택
	char m_cmd[6]; //커맨드 입력

	scanf("%d", &m_cmd_count);  //커맨드 횟수 입력

	while (m_cmd_count != 0) {
		for (i = 0; i < 6; i++) {  //문자열 초기화
			m_cmd[i] = " ";
		}

		scanf("%s", m_cmd);  //커맨드 입력

		////////////////////////////////////////////////////////////////
		// push
		////////////////////////////////////////////////////////////////
		if (strcmp(m_cmd, "push") == 0) {
			scanf("%d", &m_stack[m_index]);  //스택 쌓기
			m_index++;  //스택 위치 1층 높이기
		}
		////////////////////////////////////////////////////////////////
		// pop
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "pop") == 0) {
			if (m_index == 0) {
				printf("-1\n");
			}
			else {
				m_index--;  //스택 위치 1층 낮추기
				printf("%d\n", m_stack[m_index]);  //맨위 스택 출력
				m_stack[m_index] = 0;  //스택 반환
			}
		}
		////////////////////////////////////////////////////////////////
		// size
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "size") == 0) {
			printf("%d\n", m_index);  //크기 출력
		}
		////////////////////////////////////////////////////////////////
		// empty
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "empty") == 0) {
			if (m_index == 0) {
				printf("1\n");
			}
			else {
				printf("0\n");
			}
		}
		////////////////////////////////////////////////////////////////
		// top
		////////////////////////////////////////////////////////////////
		else if (strcmp(m_cmd, "top") == 0) {
			if (m_index == 0) {
				printf("-1\n");
			}
			else {
				printf("%d\n", m_stack[m_index-1]);  //맨위 스택 출력
			}
		}


		m_cmd_count--;  //커맨드 횟수 감소
	}

	return 0;
}
