#include <stdio.h>

/////////////////////////////////////////////////////////
//  침식 함수
/////////////////////////////////////////////////////////
void erosion(int** map, int i, int j) {
	int color = map[i][j];  //침식하는 색 저장

	map[i][j] = 0;  //침식점 0으로 변환
	if (map[i + 1][j] == color) {  //하 침식
		erosion(map, i + 1, j);
	}
	if (map[i][j + 1] == color) {  //우 침식
		erosion(map, i, j + 1);
	}
	if (map[i - 1][j] == color) {  //상 침식
		erosion(map, i - 1, j);
	}
	if (map[i][j - 1] == color) {  //좌 침식
		erosion(map, i, j - 1);
	}

	return 0;
}

/////////////////////////////////////////////////////////
//  메인함수
/////////////////////////////////////////////////////////
int main() {
	int n;
	int i, j;  //for문용 변수
	int** map1;
	int** map2;
	int group1 = 0;  //영역 갯수 저장
	int group2 = 0;
	char ch_temp;  //색상 입력용 char

	scanf("%d", &n);  //그리드 크기 입력

	/////////////////////////////////////////////////////////
	//  맵 할당 및 매핑
	/////////////////////////////////////////////////////////
	map1 = (int**)malloc(sizeof(int*) * (n + 2));  //일반 매핑
	map2 = (int**)malloc(sizeof(int*) * (n + 2));  //색약 매핑
	for (i = 0; i <= n+1; i++) {
		map1[i] = (int*)malloc(sizeof(int) * (n + 2));  //태두리까지 n+2
		map2[i] = (int*)malloc(sizeof(int) * (n + 2));  //태두리까지 n+2
		for (j = 0; j <= n+1; j++) {
			if (i == n+1 || j == n+1 || i==0 || j==0) {  //태두리는 0으로 표시
				map1[i][j] = 0;
				map2[i][j] = 0;
			}
			else {
				scanf(" %c", &ch_temp);  //색 입력
				if (ch_temp == 'R') {
					map1[i][j] = 1;
					map2[i][j] = 1;
				}
				else if (ch_temp == 'G') {  //색약은 R로 저장
					map1[i][j] = 2;
					map2[i][j] = 1;
				}
				else if (ch_temp == 'B') {
					map1[i][j] = 3;
					map2[i][j] = 3;
				}
			}
		}
	}

	/////////////////////////////////////////////////////////
	//  침식
	/////////////////////////////////////////////////////////
	for (i = 1; i <= n; i++) {
		for (j = 1; j <= n; j++) {  //침식되지 않은 점 찾기
			if (map1[i][j] != 0) {  //일반
				group1++;  //영역 +1
				erosion(map1, i, j);  //그점 중심으로 침식
			}
			if (map2[i][j] != 0) {  //색약
				group2++;
				erosion(map2, i, j);
			}
		}
	}

	/////////////////////////////////////////////////////////
	//  결과 출력
	/////////////////////////////////////////////////////////
	printf("%d %d", group1, group2);  //결과 출력

	/////////////////////////////////////////////////////////
	//  할당 해제
	/////////////////////////////////////////////////////////
	for (i = 0; i < n; i++) {
		free(map1[i]);
		free(map2[i]);
	}
	free(map1);
	free(map2);

	return 0;
}
