#include <stdio.h>
#include <stdlib.h>

// 알파벳 순번표
// abcdefghi  j klmnopqrs  t uvwxyz
// 123456789 10 123456789 20 123456
// 모음 번호
// a  e  i  o   u
// 1  5  9  15  21

void comb(int* ip_char, int* op_char, int c, int l, int cnt, int last) {
	int i;
	int cnt_v = 0;

	/////////////////////////////////////////////////////////
	//  l개의 문자열 완성했으면
	/////////////////////////////////////////////////////////
	if (cnt == l - 1) {
		for (i = 0; i < l; i++) {
			if (op_char[i] == 1 || op_char[i] == 5 || op_char[i] == 9 || op_char[i] == 15 || op_char[i] == 21) {  //모음 카운트
				cnt_v++;
			}
		}
		if (cnt_v >= 1 && l - cnt_v >= 2) {  //모음 자음 조건 만족하면
			for (i = 0; i < l; i++) {
				printf("%c", (char)(op_char[i] + 'a' - 1));  //출력
			}
			printf("\n");
		}
		return 0;
	}

	/////////////////////////////////////////////////////////
	//  cnt+1 번째 문자 선정
	/////////////////////////////////////////////////////////
	cnt++;
	for (i = last + 1; i <= c - l + cnt; i++) {  //추가할수 있는 문자들
		op_char[cnt] = ip_char[i];
		comb(ip_char, op_char, c, l, cnt, i);  //다음 단계
	}

	return 0;
}


int main() {
	int l, c;
	int i, j;
	int temp;
	char ch_temp;
	int* ip_char;
	int* op_char;

	/////////////////////////////////////////////////////////
	//  인수입력
	/////////////////////////////////////////////////////////
	scanf("%d %d", &l, &c);

	/////////////////////////////////////////////////////////
	//  문자열 할당
	/////////////////////////////////////////////////////////
	ip_char = (int*)malloc(sizeof(int) * c);
	op_char = (int*)malloc(sizeof(int) * l);

	/////////////////////////////////////////////////////////
	//  문자열 입력 (알파벳 순번으로 변환하여 저장)
	/////////////////////////////////////////////////////////
	for (i = 0; i < c; i++) {
		scanf(" %c", &ch_temp);
		ip_char[i] = (int)ch_temp - 'a' + 1;
	}

	/////////////////////////////////////////////////////////
	//  오름차순 정렬
	/////////////////////////////////////////////////////////
	for (i = 0; i < c; i++) {
		for (j = i+1; j < c; j++) {
			if (ip_char[i] > ip_char[j]) {
				temp = ip_char[i];
				ip_char[i] = ip_char[j];
				ip_char[j] = temp;
			}
		}
	}

	/////////////////////////////////////////////////////////
	//  조합 진입
	/////////////////////////////////////////////////////////
	comb(ip_char, op_char, c, l, -1, -1);

	/////////////////////////////////////////////////////////
	//  할당 해제
	/////////////////////////////////////////////////////////
	free(ip_char);
	free(op_char);

	return 0;
}
